; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite3 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite4 - satellite
	instrument15 - instrument
	infrared3 - mode
	image2 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 infrared3)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument7 thermograph0)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 thermograph0)
	(supports instrument8 infrared3)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 image2)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 GroundStation4)
	(supports instrument10 infrared3)
	(supports instrument10 thermograph0)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(on_board instrument10 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument11 image1)
	(calibration_target instrument11 GroundStation0)
	(supports instrument12 image1)
	(supports instrument12 infrared3)
	(calibration_target instrument12 GroundStation1)
	(supports instrument13 infrared3)
	(supports instrument13 image2)
	(calibration_target instrument13 GroundStation4)
	(supports instrument14 infrared3)
	(supports instrument14 thermograph0)
	(supports instrument14 image1)
	(calibration_target instrument14 GroundStation0)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(on_board instrument13 satellite3)
	(on_board instrument14 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
	(supports instrument15 image2)
	(supports instrument15 thermograph0)
	(calibration_target instrument15 GroundStation1)
	(on_board instrument15 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite1 GroundStation0)
	(pointing satellite3 GroundStation4)
	(have_image Star5 image2)
	(have_image Star6 image1)
	(have_image Star7 image2)
	(have_image Star8 infrared3)
	(have_image Planet9 thermograph0)
))

)

; plan
1. (turn_to satellite3 groundstation4 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 groundstation4)
   goals met: 2 of 8
2. (turn_to satellite2 groundstation0 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation0)
   goals met: 2 of 8
3. (switch_on instrument10 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument10)
   goals met: 2 of 8
4. (calibrate satellite2 instrument10 groundstation0)
   added: (calibrated instrument10)
   goals met: 2 of 8
5. (turn_to satellite2 star6 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star6)
   goals met: 2 of 8
6. (take_image satellite2 star6 instrument10 image1)
   added: (have_image star6 image1)
   goals met: 3 of 8
7. (turn_to satellite2 planet9 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 planet9)
   goals met: 3 of 8
8. (turn_to satellite0 groundstation4 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 8
9. (take_image satellite2 planet9 instrument10 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 4 of 8
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 8
11. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 4 of 8
12. (turn_to satellite0 star7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star7)
   goals met: 4 of 8
13. (take_image satellite0 star7 instrument1 image2)
   added: (have_image star7 image2)
   goals met: 5 of 8
14. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 6 of 8
15. (take_image satellite0 star5 instrument1 image2)
   added: (have_image star5 image2)
   goals met: 7 of 8
16. (turn_to satellite2 star8 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star8)
   goals met: 7 of 8
17. (take_image satellite2 star8 instrument10 infrared3)
   added: (have_image star8 infrared3)
   goals met: 8 of 8
